RTP/src/Tasks/МоиЗадачи/МоиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>МоиЗадачи</name>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Тестировщики</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Task>

RTP/src/Enums/СтатусыЗадачи/СтатусыЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадачи</name>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
</mdclass:Enum>

RTP/src/Tasks/МоиЗадачи/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокОткрытоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Открытый"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНаИсполненииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.НаИсполнении"));
КонецПроцедуры

&НаКлиенте
Процедура СписокЗакрытоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Закрытый"));
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусЗадач(ВыбранныеЭлементы, НовыйСтатусЗадачи)
	Для Каждого Элемент Из ВыбранныеЭлементы Цикл
		Задача = Элемент.ПолучитьОбъект();
		Если Задача.Статус = НовыйСтатусЗадачи Тогда
			Продолжить
		Иначе
			Задача.Статус = НовыйСтатусЗадачи;
			Попытка
				Задача.Записать();				
			Исключение
				СообщениеОбОшибке = Новый СообщениеПользователю();
				СообщениеОбОшибке.Текст = ОписаниеОшибки();
				СообщениеОбОшибке.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗадач(ВыбранныеЗаписи, НовыйСтатус)
	УстановитьСтатусЗадач(ВыбранныеЗаписи, НовыйСтатус);
	ОбновитьИнтерфейс();	
КонецПроцедуры
